In [1]:
import pandas as pd

### 一、拆分_第一种写法

In [2]:
excel_split = pd.read_excel('待拆分.xlsx')
excel_split.head()

     name  number  price
0   apple      12     10
1   apple       1      1
2  banana      18     12
3   apple      20      8
4  banana      20     10

In [3]:
group = excel_split.groupby(by='name')
list(group)

[('apple',
      name  number  price
  0  apple      12     10
  1  apple       1      1
  3  apple      20      8),
 ('banana',
       name  number  price
  2  banana      18     12
  4  banana      20     10
  6  banana      20     13),
 ('cherry',
       name  number  price
  5  cherry      20     15
  7  cherry      10     13)]

In [5]:
with pd.ExcelWriter('拆分1.xlsx') as writer:
    for datas in group:
        sheet = pd.DataFrame(datas[1])
        sheet.to_excel(writer, sheet_name=datas[0], index=False)
        print(sheet)

    name  number  price
0  apple      12     10
1  apple       1      1
3  apple      20      8
     name  number  price
2  banana      18     12
4  banana      20     10
6  banana      20     13
     name  number  price
5  cherry      20     15
7  cherry      10     13

### 二、拆分_第二种写法（推荐）

In [6]:
df = pd.read_excel('待拆分.xlsx')
df.head()

     name  number  price
0   apple      12     10
1   apple       1      1
2  banana      18     12
3   apple      20      8
4  banana      20     10

In [7]:
names = df['name'].unique()  # 通过唯一值方式，将‘name’字段去重，unique()方法作用在Series上
names

array(['apple', 'banana', 'cherry'], dtype=object)

In [8]:
with pd.ExcelWriter('拆分2.xlsx', engine='openpyxl', mode='w') as writer:
    for name in names:
        excel = df.loc[df['name'] == name]
        excel.to_excel(writer, sheet_name=name, index=False)
        print(excel)

    name  number  price
0  apple      12     10
1  apple       1      1
3  apple      20      8
     name  number  price
2  banana      18     12
4  banana      20     10
6  banana      20     13
     name  number  price
5  cherry      20     15
7  cherry      10     13

### 三、合并

In [9]:
excel_merge = pd.ExcelFile('拆分1.xlsx')
result = []
for sheetName in excel_merge.sheet_names:
    reader = pd.read_excel(excel_merge, sheet_name=sheetName)
    result.append(reader)
results = pd.concat(result)

results.to_excel('合并.xlsx', sheet_name='合并', index=False)
results

     name  number  price
0   apple      12     10
1   apple       1      1
2   apple      20      8
0  banana      18     12
1  banana      20     10
2  banana      20     13
0  cherry      20     15
1  cherry      10     13